doc/demo-app-1.org
#+TITLE: Demo App 1

* Introduction
Hi this is the Demo App. It's also the documentation.

Today we're building a generic monitoring application that will let you:
1. Collect logs from an arbitrary number of apps via REST API,
2. Track whether they it has started and is running,
3. Notify yourself if there's a problem, or send you an hourly OK test.

We're using Dataworks to do this, as it's the Dataworks Demo App, after all!

What do we assume you know?
1. Clojure. If not, read Clojure for the Brave and True (braveclojure.com) to awaken your inner clojure viking. It's free and will teach you the basics, which is all you need for this tutorial.
2. What a REST API is, and a bit about web tech. YouTube is the place to go to learn more about this.
3. What Kafka is. Again YouTube is sufficient. You just need the basics. It doesn't come up in part 1, but it does in part 2.

* Now, what is Dataworks, and why am I here?
Dataworks is an web app that lets you build web apps, and make changes as your apps run, so you don't have to redeploy every time you make a minor change. Dataworks stores your code, written in clojure, in a database, and runs it and any changes as you make them. In practical terms: Need a new endpoint? Need to add some functionality or fix a bug? Just change those things while the rest of the app runs happily oblivious of the changes that are taking place. As for why you're here? Why are any of us here? IDK, but we aren't here to discuss existential questions.

Now, the first thing to understand about Dataworks is that it works on the basis of Stored Functions. What the hell is a Stored Function?

A Stored Function is a Clojure expression that is stored in a database and evaluated at runtime, and reevaluated every time it changes. It is usually a function, or a map of functions, or something that evaluates to a function, depending on what we're talking about. Basically, we treat Code as Data and store it in a database.

Now, due to the requirements of programmers writing things that are actually useful, these usually aren't pure functions, however a well architected Dataworks Stored Function will rely on only a single store of app state, the Database.

There are 4 types of Stored Functions in Dataworks:
1. The Collector
2. The Transactor
3. The Internal
4. The Transformer

Of the four of them, only the Transformer is actually a pure function, and even then, that's only if you don't try to make it an impure function by calling a transactor or something.

We'll go through each of the four by providing an actual meaningful example, as well as some exposition on what each one is meant to do, and not to do. Though again, this is clojure. You're allowed more flexibility than with any other language, or application framework, or db/stored-procedure thing. With great power comes great responsibility, and how you architect your Dataworks app is ultimately up to you.

