doc/demo-app-1.org
* The Collector
The Collector is arguably the most fundamental of the four types of Stored Functions in Dataworks. Not in any kind of fancy shmancy programming sense. This isn't a Rich Hickey talk, and I'm not nearly so sophisticated. Dataworks was conceived as a way to create a new API endpoint for your application without taking down your entire app and redeoploying it. To do that, I came up with the collector.

So what the hell is a Collector? A Collector is an API endpoint. It's a web address, along with some functions that say what happens when someone uses that web address. When you add a collector you add an endpoint to your API while your API is running, and when you change a collector, you change what that API endpoint does while the API is running. Pretty neat huh? We use a library called Yada to tell Dataworks what to do when a request is made of our endpoint. A collector is a Yada Resource. And a Yada Resource is a map of functions and other info about things like authentication, and a brief description.

Here's the thing, Right you're only allowed to evaluate 1 s-expression. I'd be tempted to prtend it's some sort of security thing, but really it's just a limitation we haven't gotten around yet. However, because clojure is clojure, you can create functions inside of functions, and even name them if you do it inside a let macro (if you didn't know let is a macro in clojure). Every stored function lives inside a namespace, and there's a namespace for each type of stored function. This doesn't mean you can call one stored function from another, except for transactors via the "transact!" function and transformers via the "transformers" macro. The stored functions are evaluated as anonymous functions, and other means have to be used to refer to them.

Collectors have access to your database (we use a database called Crux, and I'll explain why in a bit) a time library called tick to tell time, a safe read-string so you can accept serialized edn params, the dataworks.utils.common namespace so you can use some of the handy convenience and validation functions I've written, and yada, so you can make yada resources easily.

Here's what the namespace looks like:

#+BEGIN_SRC clojure
(ns dataworks.collectors
  (:require
   [clojure.pprint :refer [pprint]]
   [dataworks.authentication :refer [authenticate
                                     authorize]]
   [dataworks.utils.common :refer :all]
   [dataworks.db.user-db :refer [user-db
                                 submit-tx
                                 query
                                 entity]]
   [dataworks.stream-utils :refer [produce!]]
   [dataworks.time-utils :refer [consume-time]]
   [dataworks.transactor :refer [transact!]]
   [dataworks.transformer :refer [transformers]]
   [crux.api :as crux]
   [mount.core :refer [defstate] :as mount]
   [tick.alpha.api :as tick]
   [yada.yada :refer [as-resource] :as yada]
   [schema.core :refer [defschema] :as schema]))
#+END_SRC

This is in addition to clojure.core, as well as everything
that ships with clojure.core. Don't call eval on expressions
from untrusted sources! read-string is safe because we've
inserted a safe read-string which does not eval what it
reads, and you can require other libraries if you put them on
the class path, and have the require statement in your code.

I'll say it again: DON"T CALL EVAL ON UNTRUSTED CODE!!! And
if you do call eval on untrusted code, after we told you not
to then you deserve to get owned.

Our collector (the json field names are commented.)
Path: "demo-app"
Name: "demo-app"
Resource:

#+BEGIN_SRC clojure
{:id :demo-app
 :description "captures data from apps"
 :methods
 {:post
  {:consumes #{"application/json"}
   :produces "application/json"
   :response
   (fn [ctx]
     (let [{:keys [app event details next-event]} (:body ctx)
           id (keyword app "log")
           now (tick/now)
           pr-event {:crux.db/id id
                     :log/event event
                     :log/time now
                     :app/name (keyword app)
                     :app/alert (keyword app "alert")}
           details? #(if details
                       (assoc % :log/details details)
                       %)
           top-of-the-hour (consume-time now :hours)
           next-event? #(let [nxt (consume-time
                                   now
                                   next-event)]
                          (assoc %
                                 :alert/next-event
                                 (if nxt
                                   nxt
                                   top-of-the-hour)))
           tx-event (-> pr-event
                        details?
                        next-event?)
           alert-event {:crux.db/id (keyword app "alert")
                        :app/name (keyword app)
                        :alert/timestamp now}]
       (submit-tx (if (= :never
                          (:alert/next-event tx-event))
                     [[:crux.tx/put tx-event]]
                     [[:crux.tx/put tx-event]
                      [:crux.tx/put alert-event
                       (tick/inst (:alert/next-event tx-event))]]))
            tx-event))}}}
#+END_SRC

Well that's all nice and tidy, right? No? Well luckily I wrote a handy convencience function that makes it more like the kind of code you'd write everyday at the repl. It's included in dataworks.utils.common so you'll be able to use it with every stored function.

#+BEGIN_SRC clojure
(defmacro ->let [& forms]
  (loop [lets []
         forms forms]
    (if (< 1 (count forms))
      (let [form (first forms)
            exp-form (macroexpand form)]
        (if (= (first exp-form)
               'def)
          (recur (apply conj lets (rest exp-form))
                 (next forms))
          (recur lets (next forms))))
      `(let ~lets ~(last forms)))))
#+END_SRC

Here's some example input:
#+BEGIN_SRC clojure
(->let
  (defn plus-2
    [a]
    (+ 2 a))
  (fn [b]
    (/ (plus-2 b) 3)))
#+END_SRC

And here's its output (macroexpanded):
#+BEGIN_SRC clojure
(let
  [plus-2 (fn [a]
            (+ 2 a))]
  (fn [b] (/ (plus-2 b) 3)))
#+END_SRC

The above actually returns a function, Because that's what the macroexpanded form evaluates to. Essentially, it takes every expression but the last that macroexpands to (def name expression) and makes it so that the name and expression are part of a let expression:
#+BEGIN_SRC clojure
(let [name-1 expression-1
      ...
      name-n expression-n]
  last-expression)
#+END_SRC

Any expressions (except the last) that don't macroexpand out to ~(def something expression)~ are simply thrown out.

Let's try that with our collector:
#+BEGIN_SRC clojure
(->let
 (def now      ;; we want only a single value for now
   (tick/now)) ;; so best define it once

 (def top-of-the-hour
   (consume-time now :hours))

 (defn pr-event
   [{:keys [app event details next-event]}]
   {:crux.db/id (keyword app "log")
    :log/event event
    :log/time now
    :app/name (keyword app)
    :app/alert (keyword app "alert")})

 (defn details?
   [pr-event details]
   (if details
     (assoc pr-event :log/details details)
     pr-event))

 (defn next-event?
   [pr-event next-event]
   (let [nxt (consume-time now next-event)]
     (assoc pr-event
            :alert/next-event
            (if nxt
              nxt
              top-of-the-hour))))

 (defn db-fy
   [{:keys [details next-event] :as params}]
   (-> params
       pr-event
       (details? details)
       (next-event? next-event)))

 (defn alert-fy [{:keys [app]}]
   {:crux.db/id (keyword app "alert")
    :app/name (keyword app)
    :alert/timestamp now})

 (defn handle-event
   [params]
   (let [tx (db-fy params)
         alert (alert-fy params)]
    (submit-tx
    (if (= :never
           (:alert/next-event tx))
      [[:crux.tx/put tx]]
      [[:crux.tx/put tx]
       [:crux.tx/put alert
        (tick/inst (:alert/next-event tx))]]))))

 {:id :demo-app
  :description "captures data from apps"
  :methods
  {:post
   {:consumes #{"application/json"}
    :produces "application/json"
    :response
    (fn [ctx]
      (handle-event (:body ctx)))}}})
#+END_SRC

Now, I know what you're about to say. Wait a minute, that does the same thing as the other one! And it's 20 lines longer! What gives? And the answer is that writing code this way makes so that it's easier to go function by function and make sure that you're getting the result you want from each function. Is it less concise? Yeah. Is it easier to write? Also yeah. And that's the point.

A brief explanation of the various convenience functions used in the above:

consume-time:
  Produces: java.time.Instant, :never, or nil, or
            a sequence/lazy-sequence of the same.

  Accepts the following as time-literals, java types, a string representation which tick/parse can turn into one of the acceptable types, a (lazy?) sequence of any of the above or either of the previous serialized (stringified) by clojure.core/pr-str :

  Consumes: java.time.Instant (#time/instant)
            java.util.Date (#inst)
            java.time.LocalDate (#time/date)
            java.time.Duration (#time/duration)
                (returns as now + duration)
            java.time.Period (#time/period)
                (returns as today's date + period)
            java.time.DayOfWeek (#time/day-of-week)
                (returns as next day-of-week)
            int (number of milliseconds,
                 returns as now + milliseconds)
            keyword indicating a duration or period
                (ex: :millis, :seconds, :minutes :hours,
                 :weeks, :months, :years)
            keyword indicating never (:never)

 WARNING: Currently bad inputs don't produce exceptions, but
          just return nil. This is because I haven't figured
          out how to handle typed polymorphism in Clojure yet.

submit-tx:
  An aliased form of crux/submit-tx.
  Effectively it's ~#(crux/submit-tx db %)~
  See crux documentation for more info.

query:
  An aliased form of crux/q.
  Effectively it's ~#(crux/q (crux/db db) %)~. Although it also accepts optional valid-time and transaction-time arguments for more intensive queries.
  Arities:
    [query],
    [valid-time query],
    [valid-time transaction-time query]

So what have we done in 63 lines? We've create an api endpoint that accepts event data from arbitrarily many different functions, and creates alerts for them if they don't respond in a certain amount of time. Now we need to figure out how to actually tell somebody about these alerts.

