doc/demo-app-1.md


<a id="org2ba9088"></a>

# The Transactor

The Transactor does a thing when it&rsquo;s called. That&rsquo;s it. It can do it as many times as you call it to. It doesn&rsquo;t return anything (though I&rsquo;m working on that). But it does what you tell it to, when you tell it to. It&rsquo;s what our dads all wish we&rsquo;d have been.

The important thing about a transactor is that you can call it from other Stored Functions. A Transactor is your ticket to the outside world. With a simple (transact! :your-transactor arguments) you can send text-messages, emails, call other API&rsquo;s or whatever you want!

For his transactor we use the Twilio API to send ourselves text messages. I might have sent an infinite loop of them while developing the transactor, but I did it so you don&rsquo;t have to! Again it&rsquo;s just one s-expression per Stored Function. For transactors we give you clj-http so you can contact the outside world, cheshire because, clj-http likes that, and our time library tick, for obvious reasons.

Our transactor that we use to text ourselves: client is the included clj-http.client The following are provided in the transactors namespace: [cheshire.core :as cheshire] [clj-http.client :as client] [tick.alpha.api :as tick]

 Our transactor:
name: &ldquo;text&rdquo;
function:

    (fn [body phone-number]
      (let [twilio-sid "YOUR TWILIO SID"
            twilio-token "YOUR TWILIO TOKEN"
            hello-body {:Body (str body)
                        :From "YOUR TWILIO NUMBER"
                        :To phone-number}]
        (client/post
         (str "https://api.twilio.com/2010-04-01/Accounts/"
              twilio-sid
              "/Messages.json")
         {:basic-auth [twilio-sid twilio-token]
          :form-params hello-body})))

Well, isn&rsquo;t that simple! You call it using the transact! function which is available in every stored-function namespace.

    (transact! :text "Hello World!")

Pretty nifty, right? You can do it as many times as you want, and it all happens asyncronously, so it won&rsquo;t block the rest of your function.


<a id="orgaf0435f"></a>

# The Internal

The Internal does something on a timer, or whenever it thinks is necessary. It&rsquo;s sort of like a scheduled task that can reschedule itself when it likes.

Our internal function:
  What it assumes: That our apps will either:
    a) that running our internal every minute gives us   sufficient fidelity to effectively monitor our apps
    b) that our collector that we built earlier will set up alerts for our internal to pick up
    TODO explain that db entries in crux don&rsquo;t actually exist until after their valid time, which is why alerts work.
  What it does:
    a) filter through the alerts that are currently valid
    b) filter for the ones it&rsquo;s seen previously (from the result returned previously) and send us a text about them.
    c) filter for the ones it hasn&rsquo;t seen previously and return them so that the next iteration can check on them again.

This lives in the internals namespace, for which the following are provided:

    (ns dataworks.internals
      (:require
       [dataworks.db.user-db :refer [user-db
                                     submit-tx
                                     query
                                     entity]]
       [dataworks.common :refer :all]
       [cheshire.core :as cheshire]
       [crux.api :as crux]
       [dataworks.transactor :refer [transact!]]
       [dataworks.transformer :refer [transformers]]
       [dataworks.stream-utils :refer [produce!
                                       consumer-instance
                                       consume!]]
       [tick.alpha.api :as tick]))

For convenience, user-db is aliased as db in this namespace.

Our Internal Query to find Apps that need to be monitored:

    (crux/q
     (crux/db db)
     '{:find [app timestamp status next-event]
       :where [[e :app/name app]
               [e :log/event status]
               [e :alert/next-event next-event]
               [e :app/alert alert]
               [alert :alert/timestamp timestamp]]})

Shorthand version:

    (query
     '{:find [app timestamp status next-event]
       :where [[e :app/name app]
               [e :log/event status]
               [e :alert/next-event next-event]
               [e :app/alert alert]
               [alert :alert/timestamp timestamp]]})

name: &ldquo;demo-app&rdquo;
Yes, we&rsquo;re naming it the same as the collector. It&rsquo;s actual name is :internal/demo-app because everything is namespaced, so this is fine.

initial-value:

    {:events-checked-once {}}

function:

    (->let
     (def now
       (tick/now))
    
     (def events-to-check   ;;remember this will be transformed
       (query               ;; via ->let and only exists within
        '{:find [app        ;; the scope of the ->let block
                 timestamp
                 status
                 next-event]
          :where [[e :app/name app]
                  [e :log/event status]
                  [e :alert/next-event next-event]
                  [e :app/alert alert]
                  [alert :alert/timestamp timestamp]]}))
    
     (defn waiting-since
       [t]
       (tick/minutes
        (tick/between t now)))
    
     (defn waiting-too-long?
       "If this seems weird to you, we're just writing a function that creates a function. We don't have the events-checked-once value until the final function, which why we're doing it this way."
       [events-checked-once]
       (fn [[app timestamp status next-event]]
         (if-let [previous-timestamp (get events-checked-once app)]
           (= timestamp previous-timestamp))))
    
     (defn check-in-a-minute
       [event-map [app timestamp status next-event]]
       (assoc event-map app timestamp))
    
     (defn text-the-dev
       [[app timestamp status next-event]]
       (transact! :text
                  (str app " has not checked in.\n\n"
                       "Expected information "
                       (waiting-since next-event)
                       " minutes ago.\n"
                       "Have not heard from " app
                       " for " (waiting-since timestamp) "minutes.")))
    
     (fn [{:keys [events-checked-once]}]
       (if-not (empty? events-to-check)
         (do
           (doseq
            [alert (filter
                    (waiting-too-long?
                     events-checked-once)
                    events-to-check)]
             (text-the-dev alert))
           (println (filter (complement
                             (waiting-too-long?
                              events-checked-once))
                            events-to-check))
           {:events-checked-once
            (reduce check-in-a-minute {}
                    (filter (complement
                             (waiting-too-long?
                              events-checked-once))
                            events-to-check))
            :next-run (tick/new-duration 1 :minutes)})
         {:events-checked-once {}
          :next-run (tick/new-duration 1 :minutes)})))
