doc/demo-app-1.md


<a id="org0d7f780"></a>

# The Transformer

<del>So far I haven&rsquo;t written the code for Transformers yet so&#x2026; Transformers TODO in disguise!!!</del>

I got a bit too attached to that joke I&rsquo;m afraid, so it stays in. The transformer really is the fundamental unit of the dataworks platform. It&rsquo;s the only stored function that actually returns a value (or a function, or any valid clojure object really), and it&rsquo;s really where the power of dataworks lies. When you change one, everything that uses it get&rsquo;s changed too. You can reuse different functions if you create them as transformers. Your, collectors, transformers, and internals can all be built almost entirely as transformers and then have the relevant transformer be called by a barebones calling function. You can even namespace them (and you should).

I don&rsquo;t have an example yet, as this demo app that we&rsquo;ve been going through didn&rsquo;t really seem to need them (though later ones will), but I thought I should at least introduce it here.

Let&rsquo;s say we wanted to use our waiting-since? function in more than one stored function. We could turn it into a transformer to do so.

name: &ldquo;time-utils/waiting-since&rdquo;
function:

    (fn [t]
      (tick/minutes
       (tick/between t now)))

And then would call it like this:

    (transformers [time-utils/waiting-since]
     ...
     (time-utils/waiting-since my-time)
     ...)

That&rsquo;s it. The transformers block is available in every stored function namespace (including the transformers one) and it grabs the functions you want, and makes them available in the scope of the transformers block. The transformers block also puts everything in an implict ->let block, so you can have your defs and defns in that block with no trouble. As always, it&rsquo;s worthwhile to read the code for all these things. Dataworks is pretty small, so you shouldn&rsquo;t hesitate in that regard.


<a id="org8f2e275"></a>

# Naming things.

This is important, and probably should have come earlier in the story, but all your names should be easily converted to a valid keyword. Run (keyword your-name) on the name parameter that you send to dataworks, and if it doesn&rsquo;t look right to you, then use something that does. If you&rsquo;re using namespaced names, then you should realize that when you try to update the stored-function via api, you&rsquo;ll most likely need to replace the slash (*) with a period (.) in the web address. For instance time-utils/waiting-since becomes transformer/time-utils.waiting-since. (hopefully in future updates it will be transformer.time-utils/waiting, which is arguably the /correct* way to do it, but it isn&rsquo;t yet.)

